let list = {

			'آش':[
				'آش رشته',
				'آش کشک(و آش کشک خوزستانی)',
				'آش ماست',
				'آش غوره',
				'آش گندم',
				'آش بلغور',
				'آش قلمکار(و قلمکار شیرازی)',
				'آش گوجه',
				'آش آلوچه',
				'آش انار',
				'آش اسفناج',
				'آش ترشی شمالی',
				'آش بادمجان',
				'آش اماج',
				'آش دندانی',
				'آش کارده شیرازی',
				'آش ترخینه یا سیرابی',
				'آش دوغ آذربایجانی(و آش دوغ لری)',
				'آش مصفی شهرکردی',
				'آش آخورک کازرونی',
			],
			'آبگوشت':[
				'آبگوشت باغی',
				'آبگوشت بزقرمه',
				'آبگوشت قنبید',
				'آبگوشت بزباش',
				'آبگوشت غوره',
				'آبگوشت کرمانی',
				'آبگوشت دیزی',
				'آبگوشت ماش و قمری',
				'آبگوشت گوشت و نخود اصفهانی'
			],
			'اشکنه':[
				'اشکنه با دانه انار خشک یا ترشی انار',
				'اشکنه با ماست',
				'اشکنه باقالا عربی',
				'اشکنه قارچ شهرکردی',
				'اشکنه با آرد شهرکردی',
				'گوجه',
				'گردو',
				'آلبالو',
				'زرشک',
				'کاله جوش'
			],
			'کباب':[
				'کباب کوبیده',
				'کباب برگ',
				'کباب بختیاری',
				'کباب وزیری',
				'کباب سلطانی',
				'کباب ترش',
				'کباب چنجه',
				'کباب قفقازی',
				'کباب شیشلیک',
				'جوجه کباب',
				'کباب کوبیده مرغ',
				'کباب ماهی تابه ای',
				'کباب ماهی صبور',
				'کباب فیله کبابی ماهی',
				'میگو کبابی',
				'کباب ماهی قزل آلا',
				'کباب ماهی اوزون برون',
				'کباب حسینی اصفهانی',
				'کباب جگرورز لری',
				'کباب دل و قلوه کبابی'
			],
			'کوفته':[
				'کوفته تبریزی',
				'کوفته سبزی شیرازی',
				'کوفته کپه عربی',
				'کوفته حشیشنه کنگانی',
				'کوفته بلغور شهرکردی',
				'کوفته برنجی',
				'کوفته ماهی',
				'کوفته هویج',
				'کوفته ریزه یا قلقلی',
				'کوفته شیرین کرمانشاهی',
			],
			'کوکو':[
				'کوکو بادمجان',
				'کوکو سبزی',
				'کوکو مرغ و قارچ',
				'کوکو سیب زمینی',
				'کوکو کدو سبز',
				'کوکو گوشت',
				'کوکو دو رنگ',
				'کوکو سه رنگ',
				'کوکو تره فرنگی',
				'کوکو لوبیا سبز',
				'کوکو نخود فرنگی',
				'کوکو زردک',
				'کوکو باقالا',
				'کوکو مرغ و فلفل دلمه ای',
				'کوکو اسفناج',
				'کوکو مرغ و نخود فرنگی',
				'کوکو عدس',
				'کوکو گردو',
				'کوکو کدو و ریحان',
				'مافین و فلفل دلمه ای',
				'کوکو نخود فرنگی و کالباس'
			],
			'خوراک':[
				'دال عدس',
				'رامیشکا',
				'خوراک ماهیچه',
				'عدس و بادمجان',
				'بادمجان و قارچ',
				'شکم پاره',
				'جگر',
				'دل',
				'گوشت',
				'لوبیا',
				'باقالا',
				'سیرابی با کشک لرستانی',
				'گی پای اصفهانی',
				'پنکیک قارچ',
				'کرفس',
				'باقالاقاتوق گیلانی',
				'سویا',
				'لقمه ای',
				'همیس خوزستانی',
				'برانی کرفس',
				'توله با قارا خوزستانی',
				'اسفناج و قارا خوزستانی',
				'شیله تبریزی',
				'نرگسی بادمجان',
				'نرگسی لوبیا سبز',
				'میگو و گوجه فرنگی',
				'دوپیازه',
				'گوشت و فلفل دلمه ای',
				'گوشت و خامه',
				'دوپیازه گوشت شیرازی'
			],
			'چلو و پلو':[
				'زرشک پلو',
				'آلبالو پلو',
				'پلو کنگر',
				'پلو گوشت ترکی',
				'رشته پلو',
				'پلو لوبیا چشم بلبلی',
				'عدس پلو',
				'خرما پلو',
				'هویج پلو',
				'سبزی پلو',
				'شوید پلو',
				'کلم پلو و کلم پلوی شیرازی',
				'ته چین مرغ',
				'شیرین پلو',
				'میگو پلو',
				'لوبیا پلو',
				'ماش پلو نورآبادی',
				'باقالی پلو'
			],
			'خورشت':[
				'قیمه سیب زمینی ',
				'خورشت قورمه سبزی',
				"خورشت بادمجان",
				'خورشت فسنجان با گوشت یا مرغ',
				'خورشت کرفس',
				'خورشت آلو',
				'خورشت کنگر',
				'خورشت به',
				'خورشت سیب ترش شیرازی',
				'خورشت بامیه',
				'خورشت اسفناج',
				'خورشت ریواس',
				'خورشت گیلانی',
				'خورشت قیمه آذربایجانی',
				'خورشت کدو',
				'میرزا قاسمی,',
				'خورشت آجیلی عشایر بختیاری',
				'خورشت بریان بِهی کُردی',
				'جغول بغول شمالی',
				'خورشت چاقالا بادام شمالی',
				'کدو تنبل با ماش شیرازی',
				'خورشت کاری با مرغ',
				'خورشت مسما بادمجان',
				'خورشت قارچ',
				'خورشت قیمه ر,یزه با رب انار',
			]
		}
		
		function createItem(){
			var e = document.getElementById('item');
			setTime();
			for (var item in list){
				var option = document.createElement('option');
				option.innerHTML = item;
				e.append(option);
			}
		}

		function selectLicener(e){
			var a = document.getElementById('item');
			var arr = list[a.value]
			var item = Math.floor(Math.random() * arr.length);
			document.getElementById('result').innerHTML = arr[item];
			document.getElementById('retry').style.display = "block";
		}
		
		function setTime(){var d = new Date();
			var n = d.getHours();	
			if (n>13){
				document.getElementById('time').innerHTML = 'شام';
			}
		}